{
    "filename": "/Users/evanuribe/Desktop/GGU/MetricStream/metricstream_poc/data/Master Services Agreement.pdf",
    "title": "Services Agreement",
    "effective date": "2010",
    "party": [
        {
            "name": "FEDERAL HOME LOAN BANK OF CHICAGO",
            "type": "customer",
            "address": "200 E. Randolph Drive, Chicago, Illinois 60601"
        },
        {
            "name": "METRICSTREAM",
            "type": "promisee",
            "address": "2600 East Bayshore Road, Palo Alto, California 94303."
        }
    ],
    "section": [
        {
            "type": "Services Agreement",
            "text": "Services Agreement\nThis Services Agreement (“Agreement”) is made and entered into this   of  ,\n2010, (“Effective Date”) by and between FEDERAL HOME LOAN BANK OF CHICAGO, a United\nStates corporation, with its principal place of business at 200 E. Randolph Drive, Chicago, Illinois 60601\n( Bank ) and METRICSTREAM, INC  ( Company ), a Delaware corporation, with its principal place of\nbusiness at 2600 East Bayshore Road, Palo Alto, California 94303."
        }
    ],
    "service": {},
    "text": "Services Agreement \n\n \n\nThis Services Agreement (“Agreement”) is made and entered into this _______ of _________, \n2010, (“Effective Date”) by and between FEDERAL HOME LOAN BANK OF CHICAGO, a United \nStates corporation, with its principal place of business at 200 E. Randolph Drive, Chicago, Illinois 60601 \n(\"Bank\") and METRICSTREAM, INC. (\"Company\"), a Delaware corporation, with its principal place of \nbusiness at 2600 East Bayshore Road, Palo Alto, California 94303. \n\n \n \n\n \nWHEREAS, Bank and Company have entered into a Software License Agreement, dated \n________________ (“License Agreement”) and a Hosting Agreement, dated ________________ \n(“Hosting Agreement”). \n \n\nWHEREAS, Bank desires to engage the professional or consulting services of Company related \nto the Company Software (“Services”) for use in its business as set forth herein and Company desires to \nprovide such Services to Bank.  Capitalized terms not otherwise defined herein shall have the meanings \ngiven to such terms in the License Agreement or Hosting Agreement.   \n \n \ncontained and for other good and valuable consideration, the receipt of which is hereby acknowledged, \nBank and Company covenant and agree as follows: \n\nNOW, THEREFORE, in consideration of the premises and covenants and agreements herein \n\n \n\n1. \n  \n\nConsulting Services; Fees \n\n1.1  Services.  Subject to the terms and conditions of this Agreement, Company agrees to deliver to \nBank the Services as described in one or more Statement(s) of Work, as may be amended from time \nto time (referred to herein as “Statements of Work” or “SOWs”) that may be prepared, agreed upon \nand signed by both parties during the term of this Agreement.  A Statement of Work shall be in \nsubstantially the form attached hereto as Exhibit 1.   \n\n \n\n1.2  Fees; Expenses; Rates.  Bank will pay Company the fees, rates, compensation and other \namounts on a time and material basis according to the rates set forth in the applicable SOW.  Except \nas otherwise agreed to in a SOW, Bank will reimburse Company for all reasonable expenses incurred \nby Company in the performance of the Services and the delivery of any Deliverables (as defined in \nSection 2.1 below), including, but not limited to, travel and lodging expenses; provided, however, \nCompany must receive prior approval from Bank for all travel and lodging expenses.  Company must \nprovide Bank with copies of receipts or other appropriate documentation for all expenses.   \n \nCompany shall be responsible for the payment of any and all federal, state and local income taxes that \nmay arise out of its performance of the Services.  \n \n1.3 Change in Scope. If Bank requests an expansion of the scope of Services under a SOW, an \namendment to the SOW will be prepared by Company and signed by both parties.  If Company \nrequests a change in the scope of Services under a SOW, Company shall bring such requested change \nto the Bank’s attention and Bank shall determine whether such change in scope of Services is \nacceptable.  If such change in scope of Services is acceptable to Bank, an amendment to the SOW \nwill be prepared by Company and signed by both parties.    \n \n1.4 Estimates.  Unless otherwise specified in the applicable SOW, Company will perform the \nServices on a time-and-materials basis.  Company shall provide Bank with an estimated fee on each \n\n \n\n \n\n \n277968 \n \n\n1 \n\n \n\n\f \n \n\nSOW.  This is Company’s good-faith estimate of the amount the Services will cost, but is not a fixed \nfee.  Company does not guarantee the Services will be completed for such amount.  The actual cost \nwill be based on the actual time spent by various Company personnel assigned plus expenses \nincurred, and may be more or less than the estimate.  Weekly, Company will provide Bank with a \nstatus report of all activities being performed as specified in each SOW.  This status report will \ninclude, but is not limited to, reporting on a percentage of actual work performed to date, a \ncomparison of expenses and fees incurred to estimated fees within the applicable SOW, and reporting \nof any impediments that could negatively affect the timely completion of work as specified in the \nSOW.  \n \n1.5 Payment.  Unless otherwise specified in a SOW, Company shall submit invoices to Bank \nmonthly and Bank will pay Company within thirty (30) days of receipt of invoice. Bank will provide \nCompany with a certificate or other evidence of tax exemption, if requested by Company.  Any \namount not paid when due will bear interest at the rate of one and one-half (1.5%) percent per month \nor the maximum rate permitted by applicable law, whichever is less.   Notwithstanding the foregoing, \nif Bank has a bona fide dispute as to the amount of any invoice, Bank shall pay Company when due \nthe undisputed portion of the invoice and both parties agree to work diligently to resolve the dispute.  \nBank shall not be responsible for late fees incurred as a result of such dispute.     \n \n1.6 Staffing.  Company will provide fully qualified personnel (“Resources”) with a varying range of \nexperience to perform Services for Bank under the SOWs.  Resources shall be assigned to perform \nServices appropriate to their individual abilities.  Bank may make reasonable requests for the removal \nand replacement of an individual and Company shall use commercially reasonable efforts to replace \nsuch individual with a mutually agreed upon substitute resource within a reasonable time.  With \nBank’s prior approval (which shall not be required in the case of the termination of employment with \nCompany, whether voluntary or involuntary, of any particular Resource), Company may replace any \nResource with a fully qualified Resource acceptable to Bank.     \n   \n\nProprietary Rights \n\n2.1  Deliverables.  The parties grant to each other the rights as specified in this Section 2, subject to \nthe provisions of Section 11 below.  Regardless of the type of Deliverable, as defined herein, to the \nextent the Deliverables contain any Confidential Information, Proprietary Item(s), and/or Third-Party \nProduct, such Confidential Information, Proprietary Item(s), and/or Third-Party Product will continue \nto be subject to the terms and conditions of this Agreement, except as necessary to be consistent with \nthe ownership rights granted herein.  For purposes of this Agreement, “Deliverable” means all right, \ntitle and interest in and to any programs, systems, data or materials created or prepared by Company \nfor Bank under this Agreement; and \"Third-Party Product\" means any products, methodologies, tools, \nmaterials, computer programs, architecture, design specifications, flowcharts, or software (including, \nwithout limitation, any object code, source code, tool, utility or template), or other tangible or \nintangible item licensed or otherwise acquired by Company or Bank from a third party.  \n\n2.1.1  Rights in Deliverables.  Unless otherwise specified in writing and signed by both parties, \nthe Deliverables shall be the sole property of Bank and shall be considered “works made for hire,” \nas that term is defined in the Copyright Act of 1976, as amended.  In the event such work product \nshall be deemed not to constitute a work made for hire, or in the event that Company should \notherwise, by operation of law, be deemed to retain any rights therein, Company does hereby \nassign to Bank, exclusively and perpetually, all right, title and interest throughout the world in \nand to all such work product.  Bank shall have the sole and exclusive rights to all patent rights and \n\n2. \n \n\n \n\n \n\n \n277968 \n \n\n2 \n\n \n\n\f \n \n\ncopyright rights associated with such work product.   \n\n2.1.2  Rights in General Services Deliverables.   \n\n(a)  Bank acknowledges that from time to time Company develops certain reusable computer \nsoftware, techniques, information, training material and documentation (“GS Deliverables” as \ndefined herein).  As set forth in this Agreement, “GS Deliverables” means general services \ndeliverables involved in the installation and implementation of Company or third party developed \nsoftware; general education and training services; general consulting and management expertise \nfor a particular subject, or systems level code that does not include any user interface or business \nlogic developed for or specific to the Bank. \n\n(b)  Notwithstanding Section 2.1.1 above, GS Deliverables are Company’s proprietary \ninformation and intellectual property and shall not be considered “works made for hire” for the \nBank.  GS Deliverables may be incorporated into the work done by Company for Bank by prior \nagreement of the parties.  Company shall identify any GS Deliverables in the applicable SOW.  \nCompany agrees to use reasonable efforts to identify such GS Deliverables prior to the execution \nof the applicable SOW.  Nevertheless, the parties agree that Company may request amendment of \na SOW if a GS Deliverable is identified following commencement of work under such SOW, and \nthe parties shall use reasonable efforts to reach agreement on the classification and, if applicable, \nthe inclusion of such GS Deliverable in the applicable SOW.  Company grants Bank a non-\nexclusive, perpetual, irrevocable right and license to use those GS Deliverables incorporated into \nthe Deliverables developed for Bank.  Subject to the foregoing license, Company retains all rights \nto the GS Deliverables for any future use.  Bank shall protect the GS Deliverables according to \nthe policies and procedures Bank uses for its own similar proprietary information and intellectual \nproperty.   \n \n\n2.2  Company Proprietary Items.  Company’s processes, including but not limited to Company’s \nmethodology, procedures, strategies, trade secrets, know how, ideas and expertise used by Company \nand its employees and/or approved subcontractors in providing the Services, are not included in any \nDeliverable and Company retains all right, title and interest in and to such processes, including all \nintellectual property rights pertaining thereto. In addition, Bank will have or obtain no rights in any \nCompany Proprietary Items (or in any modifications or enhancements to them) other than (a) to use \nthem as authorized by Company in writing from time to time solely in connection with the Services or \nDeliverables provided by Company under this Agreement; or (b) to the extent the Company \nProprietary Items are incorporated into any Deliverable, Company hereby grants to Bank a \nnonexclusive, perpetual, world-wide, paid-up right and license to use, copy, modify and prepare \nderivative works of such Company Proprietary Items for purposes of the  business of Bank; provided, \nhowever, to the extent the Company Proprietary Items are identified assets of Company, rather than \nprogramming shortcuts, subroutines or similar tools, Company shall obtain written approval from \nBank before incorporating any Company Proprietary Items into any Deliverable.  For purposes of this \nAgreement, \"Company Proprietary Items\" means any work, materials, or other tangible or intangible \nproperty proprietary to Company and/or used by it in the course of its performance under this \nAgreement or any SOWs and that is (i) not a Deliverable, (ii) developed independently of this \nAgreement, including pre-existing materials; or (iii) designated as a Company Proprietary Item.  \nInclusion of any Company Proprietary Item in a Deliverable does not change its character as a \nCompany Proprietary Item.   \n2.3 Bank Proprietary Items.  Bank’s processes, including but not limited to Bank’s methodology, \nprocedures, strategies, trade secrets, know how, ideas and expertise provided by Bank to Company in \nthe performance of Services by Company, are not included in any Deliverable and Bank retains all \nright, title, and interest in and to such processes, including all intellectual property rights pertaining \n\n \n\n \n\n \n277968 \n \n\n3 \n\n \n\n\f3. \n \n\n \n4. \n\n5. \n\n \n \nthereto (“Bank Proprietary Items”).  In addition, Company will not have and will not obtain any rights \nin any Bank Proprietary Items (or in any modifications or enhancements to them) other than to use \nthem as authorized by Bank in writing from time to time solely in connection with the Services or \nDeliverables provided by Company under this Agreement.  Company shall return all Bank \nProprietary Items to Bank if the use of such Bank Proprietary Items is discontinued by Bank.   \n \n\nDelivery; Warranty   \n\n3.1  Delivery.  Delivery of the Deliverables will be made as specified in the applicable SOW.  (a) All \nsoftware work products provided to Bank will be deemed accepted upon installation of the \nDeliverables into Bank’s production environment, and (b) all non-software work products will be \ndeemed accepted twenty (20) business days after final submission to the Bank and the Bank has not \nprovided written notice to the person designated by Company in the applicable SOW as the contact \nperson (“Contact Person”) (written notice shall include electronic mail) identifying specifically any \nbasis for not accepting the non-software work product. \n \n3.2  Warranty.  Company warrants that: (a) the Services will be performed in a good and \nworkmanlike manner; and (b) the Deliverables will perform in all respects with the applicable \nspecifications as set forth in the SOW \n \n3.3  Authority to Enter into Agreement.  Company warrants it has full power and authority to enter \ninto and perform this Agreement. \n   \n3.4  No Warranty.  Company does not provide any warranty or representation whatsoever regarding \nsoftware code not created by Company with which the Company Software will interface nor the \ndatabases to which the Company Software may be applied. \n\nLimitation of Warranty \n\n \nWITH THE EXCEPTION OF THE EXPRESS WARRANTIES SET FORTH IN  SECTION 3, \nCOMPANY MAKES NO OTHER EXPRESS OR IMPLIED WARRANTIES, INCLUDING ANY \nIMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR \nPURPOSE OF ANY OF THE DELIVERABLES.   \n \n\nResponsibilities \n\n \n5.1  Bank Responsibilities.  Bank agrees to provide the resources, perform those tasks and fulfill \nthose responsibilities specified in the “Bank Responsibilities” section of the applicable SOW as well \nas those specified in Sections 5.3 and 5.5 below.  The SOW may also contain assumptions related to \nthe Services.  Bank understands that Company's performance is dependent on Bank's timely and \neffective performance of Bank’s responsibilities hereunder and in the SOW(s) and timely decisions \nand approvals by Bank.   \n \n5.2  Company Responsibilities.  Company will perform those tasks and fulfill those responsibilities \nspecified in this Agreement and/or any SOW.  Company understands that its performance of Services \nshall be completed in a timely manner and that any testing required to ensure the Deliverables meet \nthe specifications set forth in this Agreement and/or any SOW shall be completed by Company prior \nto Company delivering the Deliverable to Bank unless otherwise specified in the applicable SOW.   \n \n\n \n\n \n\n \n277968 \n \n\n4 \n\n \n\n\f \n \n\n5.3  Provision of Documentation.  If Bank, including its subcontractors and third party vendors, is \nresponsible for developing or providing documentation, materials and assistance to Company in \nconnection with the Services, Bank agrees to do so in a timely manner.  Company shall not be \nresponsible for any delays in completing its assigned tasks, or associated increases in the estimated \nfees, to the extent that they result from Bank’s (including its subcontractors’ and third party vendors’) \nfailure to provide such timely documentation, materials and assistance. \n \n5.4  Cooperation.  Bank and Company mutually agree to cooperate to see that the Services specified \nin the SOW are successfully completed. \n \n5.5  Third Party Vendors.  Bank represents and warrants to Company that Bank has obtained \npermission from any third party vendor, if necessary, for both Bank and Company to access and use \nBank’s system, the data on it and all hardware and software components included in it for the purpose \nof providing the Services.  If Bank does not already have such permission, it is Bank’s responsibility \nto obtain it, at Bank’s expense, before Bank asks Company to perform the Services.  Company \nrepresents and warrants to Bank that it has obtained permission from any third party vendor, if \nnecessary, to provide the Services contemplated herein.  If Company does not already have such \npermission, it is Company’s responsibility to obtain it, at Company’s expense, before Company \nperforms the Services. \n\nLimitations of Liability   \n\n6.1  Limitation of Liability.  Company’s liability with regard to any Services, Deliverables, or any \nother items furnished under this Agreement or any SOW will not exceed the compensation paid, \nincluding any due and owing, by the Bank to Company for the applicable Statement of Work.  \n\n6.2  No Consequential Damages.  NEITHER PARTY WILL BE LIABLE TO THE OTHER FOR \nANY INDIRECT, INCIDENTAL, PUNITIVE, OR CONSEQUENTIAL DAMAGES OF ANY \nTYPE, INCLUDING BUT NOT LIMITED TO SPECIAL DAMAGES OR LOSS, LOST PROFITS \nOR SAVINGS, OR LOST DATA, ARISING OUT OF OR IN CONNECTION WITH: (a) THIS \nAGREEMENT OR THE SERVICES RENDERED UNDER ANY SOW; (b) THE USE OR \nINABILITY TO USE THE SERVICES; OR (c) THE RESULTS OR OPERATION OF ANY \nSYSTEM RESULTING FROM IMPLEMENTATION OF ANY RECOMMENDED PLAN OR \nDESIGN, EVEN IF ONE OR THE OTHER PARTY HAS BEEN ADVISED OF THE \nPOSSIBILITY OF THE DAMAGE AND EVEN IF ONE PARTY ASSERTS OR ESTABLISHES A \nFAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY PROVIDED IN THIS \nAGREEMENT. \n \n6.3 Independent Allocations of Risk.  EACH PROVISION OF THIS AGREEMENT THAT \nPROVIDES FOR A LIMITATION OF LIABILITY, DISCLAIMER OF WARRANTIES, OR \nEXCLUSION OF DAMAGES IS TO ALLOCATE THE RISKS OF THIS AGREEMENT \nBETWEEN THE PARTIES.  THIS ALLOCATION IS REFLECTED IN THE PRICING OFFERED \nBY COMPANY TO BANK AND IS AN ESSENTIAL ELEMENT OF THE BASIS OF THE \nBARGAIN BETWEEN THE PARTIES.  EACH OF THESE PROVISIONS IS SEVERABLE AND \nINDEPENDENT OF ALL OTHER PROVISIONS OF THIS AGREEMENT.  THE LIMITATIONS \nIN THIS SECTION 6 WILL APPLY NOTWITHSTANDING THE FAILURE OF ESSENTIAL \nPURPOSE OF ANY LIMITED REMEDY IN THIS AGREEMENT.    \n\nIndemnification \n\n5 \n\n \n\n6. \n \n\n \n\n \n7. \n\n \n\n \n\n \n277968 \n \n\n\f \n \n\n    \n\n8. \n \n\n7.1  Bank Indemnification.  Bank agrees to defend, indemnify and hold harmless Company from \nand against any and all claims, suits, liabilities, judgments, losses, damages, fines, costs and expenses \n(including reasonable attorneys’ fees and expenses) (“Losses”) resulting from any claim, suit or \ndemand by any third party arising from (a) Bank’s failure to obtain permission for Company to access \nand use Bank’s systems (including but not limited to hardware, software, utilities, databases and their \ncontents and all other components) that Bank asks Company to work on; (b) Bank’s failure to obtain \nthe appropriate license or other intellectual property rights necessary to permit Company to perform \nthe Services; and (c) the effect, if any, on Bank’s third-party product warranties caused by having \nCompany perform service on such third-party products; (iv) injuries to or deaths of persons caused by \nBank, or (v) Bank’s breach of the confidentiality provisions contained herein, except to the extent \nsuch Losses are proximately caused by the negligence or intentional misconduct of Company.  \nCompany agrees to provide Bank with written notice of any such third party claim or suit and \nreasonable cooperation in the defense of any such claim or suit.  Bank shall have complete control \nover the defense and settlement of any such claim or suit.  Bank will defend such claim or suit at its \nexpense and will pay any costs or damages that may be finally awarded against Company.    \n  \n \n7.2  Company Indemnification.  Company shall defend, indemnify and hold harmless Bank from \nand against any and all Losses resulting from any claim, suit or demand by any third party arising \nfrom (a) infringement of an intellectual property or other proprietary right of any third party arising \nfrom any act by Company or Bank’s exercise of the rights granted hereunder; (b) injuries or deaths of \npersons caused by Company; (c) a claim that Bank is the statutory employer of any of Company’s \nprincipals, employees, or contractors for purposes of taxation or workers’ compensation, or (d) \nCompany’s breach of any of the confidentiality provisions contained herein, except to the extent such \nLosses are proximately caused by the negligence or intentional misconduct of Bank.  Bank agrees to \nprovide Company with written notice of any such third party claim or suit and reasonable cooperation \nin the defense of any such claim or suit.  Company shall have complete control over the defense and \nsettlement of any such claim or suit.  Company will defend such claim or suit at its expense and will \npay any costs or damages that may be finally awarded against Bank.    \n \n\nConfidentiality \n\n8.1  Definition.  “Confidential Information” shall mean all information disclosed by a party \n(“Discloser”), whether of a technical, business or other nature relating to that party’s technology, \nresearch, product development strategy and activity, marketing plans and strategy, corporate \nassessments and strategic plans, pricing, financial and statistical information, accounting information, \nemployees, contractors, identity of suppliers, software systems, services, processes, formula \ninventions, discoveries, policies, guidelines, procedures, practices, disputes or litigation.  The \nforegoing list is given by way of example and is not intended to be all-inclusive.  Confidential \nInformation shall also include all nonpublic personal information (as that term is defined in the \nGramm-Leach-Bliley Act) and all similar categories of information defined under other applicable \nprivacy laws (“Nonpublic Personal Information”).  Confidential Information does not include any \ninformation that (a) was known to the recipient of the Confidential Information (“Recipient”) prior to \nreceiving the same from the Discloser in connection with this Agreement; (b) is independently \ndeveloped by Recipient without reference to the Confidential Information of the Discloser; (c) is \nacquired by the Recipient from another source without restriction as to use or disclosure; or (d) is or \nbecomes known to the public through no fault or action of the Recipient. \n \n8.2  Confidential Information.  Except for any license or other right expressly granted under this \n\n \n\n \n\n \n277968 \n \n\n6 \n\n \n\n\f \n \n\n9. \n \n\nAgreement and/or any SOW, each party reserves any and all right, title and interest (including, \nwithout limitation, any intellectual property rights) that it may have in or to any Confidential \nInformation, as defined in this Section 8.  Recipient agrees that the Confidential Information is of \ncritical importance to the Discloser and agrees to keep all Confidential Information confidential \nwhether or not such information is marked or designated as confidential.  Recipient further agrees to \ncomply with all applicable privacy laws with respect to Confidential Information which constitutes \nNonpublic Personal Information.  The Recipient will protect Confidential Information of the \nDiscloser against any unauthorized use or disclosure to the same extent that the Recipient protects its \nown Confidential Information of a similar nature against unauthorized use or disclosure.  The \nRecipient will use any Confidential Information of the Discloser solely for the purpose for which it is \nprovided by the Discloser.   \n \nThis Section will not be interpreted or construed to prohibit:  (a) any use or disclosure which is \nnecessary or appropriate in connection with any Recipient’s performance of its obligations or exercise \nof its rights under this Agreement or any SOW or any other agreement between the parties; (b) any \nuse or disclosure required by applicable law, provided that the Recipient uses reasonable efforts to \ngive the Discloser reasonable advance notice thereof so as to afford the Discloser an opportunity to \nintervene and seek an order or other appropriate relief for the protection of its Confidential \nInformation from any unauthorized use or disclosure; or (c) any use or disclosure made with the \nconsent of the Discloser.  In the event of any breach or threatened breach by Recipient of its \nobligations under this Section, the Discloser will be entitled to injunctive relief and other equitable \nrelief to enforce such obligations. \n \n \n\nTermination  \n\n9.1.  Term.  This Agreement shall remain in effect until __________________, or until completion of \nthe various SOW(s) issued hereunder, or as provided hereunder.   \n \n9.2  Termination without Cause.  Either party may terminate this Agreement at any time upon thirty \n(30) days prior written notice to the other party.   \n \n9.3  Termination with Cause.  Either party may terminate this Agreement or any SOW if the other \nparty is in material breach or default of any obligation hereunder, which breach or default is not cured \nwithin fifteen (15) days of written notice from the other party.  Notwithstanding the foregoing, if the \nbreach or default is such that it cannot be cured, including but not limited to, the defaulting party \nentering or being forced into bankruptcy or liquidation, the nonbreaching party has the right to \nterminate the Agreement, Services, and/or SOWs immediately.   \n \n9.4  Termination for Lack of Payment.  If Bank fails to perform any payment obligations \nhereunder, and such failure remains unremedied for fifteen (15) days after notice of such failure by \nCompany, Company may suspend its performance of any SOW(s) until payment is received or \nterminate this Agreement and any SOW(s) upon written notice. \n \n9.5  Payment of Accrued Fees Upon Termination.  Upon any termination of this Agreement or any \nSOW, Bank shall pay all of Company’s unpaid fees and out-of-pocket expenses described in Section \n1.2 above accrued through the effective date of such termination. \n\n9.6  Effect of Termination.  If the Agreement and/or any SOW is terminated pursuant to this Section \n11, then:  (a) the parties will cooperate to effect an orderly, efficient, effective and expeditious \n\n \n\n \n\n \n277968 \n \n\n7 \n\n \n\n\f \n \n\ntermination of the parties’ respective activities under the terminated Agreement and/or SOW; (b) \nCompany shall promptly return to Bank any and all Bank Proprietary Items and any copies of such \nitems or products delivered by Bank to Company under the terminated Agreement and/or SOW and \ndeliver to Bank a written certification of such return signed by an officer of Company; (c) upon \npayment by Bank of all fees due for work performed, Company shall promptly deliver to Bank the \nbalance of all software work products and all other non-software work products being produced by \nCompany under the terminated Agreement and/or SOW and deliver to Bank a written certification of \nsuch return signed by an officer of Company; (d) Company will have no obligation to perform any \nServices under the terminated SOW after the effective date of the termination; (e) any and all \nliabilities accrued prior to the effective date of the termination will survive; and (f) the parties’ \nrespective rights and obligations under Sections 1.2; 1.3; 1.5; 2; 6; 7; 8; 9.6; and 11 of this Agreement \nwill survive such termination of the Agreement and/or SOW. \n\n  \n\nNotices \n\n \nAll notices provided for herein shall be in writing and may be given or served by (a) depositing the \nsame in the mail, postage prepaid, registered, or certified with return receipt requested, and addressed \nto the party’s representative, whose name and address appears below; or (b) telex, facsimile, \ntelegraph, telecopy, or other written telecommunication medium (which shall require evidence of \nhard copy confirmation to be effective in the event of any dispute regarding the giving of notice) to \nthe party’s representative named below.  Each party can change its respective designated \nrepresentatives, or its address, by providing written notice to the other. \n\n10. \n\n \n\n \n\n \n\n \n\n \n\n \n\nIf to Company: \n \n  MetricStream, Inc. \n  2600 East Bayshore Road \n  Palo Alto, CA 94303 \n  Attn: Bill William. \n \n \nIf to Bank: \n \n     Federal Home Loan Bank of Chicago \n     200 E. Randolph Drive \n \n \n\n  Chicago, IL 60601 \n  Attn:  Audit Department \n\n \n \n11.  Miscellaneous \n \n\n11.1  Governing Law/Attorney Fees.  THIS AGREEMENT WILL BE GOVERNED BY AND \nCONSTRUED IN ACCORDANCE WITH THE LAWS OF THE STATE OF ILLINOIS, WITHOUT \nREGARD TO PRINCIPLES OF CONFLICTS OF LAW.  If either party employs attorneys to \nenforce any rights arising out of or relating to this Agreement, the prevailing party shall be entitled to \nrecover its reasonable attorneys’ fees, costs and other expenses. \n \n11.2  Independent Contractor.  Company is an independent contractor.  Neither party will consider \nthe other its agent or representative. Bank will not be responsible for paying benefits or employment \n\n \n\n \n\n \n277968 \n \n\n8 \n\n \n\n\f \n \n\ntaxes for the Company’s employees who perform the Services, and they will not be considered \nBank’s employees.  Company is solely responsible for determining the method and means by which it \nwill accomplish the Services and otherwise fulfill its obligations hereunder. \n \n11.3  Entire Agreement.  This Agreement and any SOW(s), including all attachments and exhibits \nthereto, is the complete agreement between the parties.  Modifications must be in writing and signed \nby both parties. \n \n11.4  Books and Records.  Bank or its representatives shall have access to and the right to examine \nduring regular business hours on at least three (3) business days prior written notice, and Company \nagrees to keep and maintain, any directly pertinent books, documents, papers and records of Company \ninvolving transactions related to this Agreement for two (2) years after the completion of the Services \nto which such records relate. \n \n11.5  Assignment.  Neither party may assign this Agreement, in whole or in part, without the express \nwritten consent of the other party.   \n \n11.6  Severability/Waiver.  If any provision of this Agreement proves to be or becomes invalid or \nunenforceable under any applicable law, then such provision shall be deemed modified to the extent \nnecessary to render such provision valid and enforceable. If such provision may not be so saved, it \nshall be severed and the remainder of this Agreement shall remain in full force and effect.  No waiver \nof any breach of any provision of this Agreement shall constitute a waiver of any other breach of the \nsame or any other provision hereof, and no waiver shall be effective unless made in writing and \nsigned by an authorized representative of the waiving party. \n \n11.7  Force Majeure.  If circumstances beyond the control of a party shall temporarily make it \nimpossible for it or both of them to perform their obligations under this Agreement, then the \nprincipals of force majeure shall apply and the rights and obligations or the parties will be temporarily \nsuspended during the force majeure period to the extent that such performance is reasonably affected \nthereby; provided, however, that the party uses best efforts to promptly overcome or mitigate the \ndelay or failure to perform.  Bank’s failure to provide timely documentation, materials and assistance \nto Company in performing its Services may be a force majeure with respect to Company. \n \n11.8  Surviving Sections.  Whenever the context requires, any commitment or obligation provided \nfor in this Agreement shall survive termination or expiration hereof. \n \n11.9  No Third-Party Beneficiaries.  This Agreement is for the benefit of, and will be enforceable \nby, the parties only.  This Agreement is not intended to confer any right or benefit on any third party.  \nNo action may be commenced or prosecuted against a party by any third party claiming to be a third-\nparty beneficiary of this Agreement or any of the transactions contemplated by this Agreement.  \n\nIN  WITNESS  WHEREOF  the  parties  have  executed  this  Agreement  in  duplicate  originals  as  of  the \ndates below, with effect as of the Effective Date. \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n277968 \n \n\n9 \n\n \n\n\fMetricStream, Inc. \n\n  Federal Home Loan Bank of Chicago \n\n \n \n\nBy \n\n(Print Name) \n\nTitle \n\nDate \n\n \n\n  By \n\n \n\n(Print Name) \n\n  Title \n\n  Date \n\n \n\n \n\n \n277968 \n \n\n10 \n\n \n\n\fExhibit 1 \n\n \n \n\nSTATEMENT OF WORK: Project Name \n\nEFFECTIVE DATE:  mm-dd-yyyy \n\nCONSULTING SERVICES  \n\n \n\n \n\n \nThe  parties,  MetricStream,  Inc.  (“Company”)  and  Federal  Home  Loan  Bank  of Chicago  (the  “Bank”), \nagree that the terms of this Statement of Work shall be subject to the terms of the Services Agreement \nbetween the parties, effective          (the \"Agreement\").  In the event of a conflict between the terms of the \nAgreement and the terms of this Statement of Work, the terms of this Statement of Work shall control.  \nThis Statement of Work shall have effect from        (the “Effective Date”). \n \n \nSCOPE OF WORK: \nThis  Statement  of  Work  defines  the  _____________________________  Company  will  provide  to  the \nBank for the following applications (“Services”): \n \nAPPROACH: \n \nThe  following  approach(es)  will  be  followed  by  the  Bank  and  Company  to  discover,  specify,  plan, \nconstruct, test, and deploy work covered under this Statement of Work: \n \nDELIVERABLES: \nThis Statement of Work is designed for the [Project Name].  The project Deliverables created as a result \nof the Services under this Statement of Work, will be categorized as Deliverables under section 2.1.1 of \nthe Agreement.  For purposes of understanding, these Deliverables are not general services deliverables, \ndefined as “GS Deliverables” in Section 2.1.2 of the Agreement. \n \nStandard Deliverables may include the following components mutually agreed upon between the parties: \n \n \nDeliverables may be adjusted in the form of an amendment to this Statement of Work. \n \nDURATION OF WORK ASSIGNMENT: [ ____], 2010 to [          ], 20__   \nESTIMATED BANK FEES:   \nASSUMPTIONS: \nBANK OBLIGATIONS: \nThe Bank understands that the success of this Statement of Work is a collaborative effort, and includes \ncertain actions which are under the control of the Bank.  In addition to any other responsibilities or duties \ndescribed in this Statement of Work, set forth below is a list of the obligations for which the Bank is \nresponsible upon which Company has relied in agreeing to perform the Services described in this \nStatement of Work on the terms set out herein (including the estimates) (“Bank Obligations”): \n \n \nIf any of the above Bank Obligations are not performed or prove to be incorrect or untrue, it may impact \nthe project schedule, fees and expenses, Deliverables, or level of effort required and result in delays to the \nproject and increased costs to the Bank.   \n\n \n\n \n\n \n\n \n277968 \n \n\n11 \n\n \n\n\f \n \n\nOUT OF SCOPE: \nThe parties understand and acknowledge that the following items are out of scope for this Statement of \nWork: \n \n \nSCHEDULE OF REVIEW: \n \nTESTING AND ACCEPTANCE: \n \nThe following describes the testing and acceptance procedures: \n \nTesting: \n \n \n \nAcceptance: \n \nCompany shall submit the aforementioned Deliverables to the Bank.  The Deliverables will be considered \naccepted upon the terms set forth in Section 3.1 of the Agreement.  \n \nThe Contact Person for purposes of the Bank providing written notice identifying any basis for not \naccepting the work product pursuant to Section 3.1 of the Agreement is ______________.  \n \nTERMINATION: \n \nBank may terminate this SOW at any time upon ___ (__) business days prior written notice to Company.   \n \nSPECIAL TERMS AND CONDITIONS: \n \nIN WITNESS WHEREOF, the parties have entered into this Statement of Work as of the last date signed \nbelow, effective as of the Effective Date. \n \n \nMetricStream, Inc. \n\n  Federal Home Loan Bank of Chicago \n\nBy \n\n(Print Name) \n\nTitle \n\nDate \n\n \n \n\n \n\n \n\n \n277968 \n \n\n  By \n\n \n\n(Print Name) \n\n  Title \n\n  Date \n\n \n\n \n\n12 \n\n \n\n\f"
}